Cases/0.1mps/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }

ddtSchemes
{
    default         Euler; // 안정성 최우선
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phirb,alpha) Gauss interfaceCompression;

    div(phi,alpha)  Gauss vanLeer; // 물-증기 계면 안정화
    div(phi,k)      Gauss upwind; // 난류는 무조건 안정적인 upwind
    div(phi,omega)  Gauss upwind;
    div(phi,T)      Gauss limitedLinear 1;
    div(phi,p)      Gauss upwind;
    div(phi,U)      Gauss limitedLinearV 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    
    div(rhoPhi,U)   Gauss upwind;
    div(rhoPhi,K)   Gauss upwind;
    div(rhoPhi,k)   Gauss upwind;
    div(rhoPhi,T)   Gauss limitedLinear 1;
    div(rhoPhi,omega)  Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
